In [1]:
import numpy as np
import pandas as pd

In [13]:
id_no = ["P001", "P002", "P003", "P004", "P005", "P006", "P007", "P008", "P009", "P010", "P011"]
gender = ["M", "F", "M", "F", "M", "F", "M", "F", "M", "F", "M"]
status = ["FT", "PT", "-", "FT", "PT", "PT", "FT", "-", "PT", "FT", np.nan]
dept = ["DS", "FS", "AWS", "AWS", "DS", None, "FS", "FS", np.nan, "DS", "AWS"]
V1 = np.array([2, 3, 5, np.nan, 7, 1, "nan", 10, 14, "a", 6])
V2 = np.array([8, np.nan, 5, 8, 11, np.nan, np.nan, 2, 3, 7, 9])
salary = np.array([np.nan, 54, 59, 120, 58, 75, None, 136, 60, 125, np.nan])

df0 = pd.DataFrame({
                   "id" : id_no,
                   "gender": gender,
                   "status": status,
                   "dept": dept,
                   "var1" : V1,
                   "var2" : V2,
                   "salary" : salary
                  })
df = df0.copy() # original veriyi korumuş olduk
df

      id gender status  dept var1  var2 salary
0   P001      M     FT    DS    2   8.0    NaN
1   P002      F     PT    FS    3   NaN     54
2   P003      M      -   AWS    5   5.0     59
3   P004      F     FT   AWS  nan   8.0    120
4   P005      M     PT    DS    7  11.0     58
5   P006      F     PT  None    1   NaN     75
6   P007      M     FT    FS  nan   NaN   None
7   P008      F      -    FS   10   2.0    136
8   P009      M     PT   NaN   14   3.0     60
9   P010      F     FT    DS    a   7.0    125
10  P011      M    NaN   AWS    6   9.0    NaN

In [26]:

status = np.array([10, "FT", "PT", "-", "FT", "PT", "PT", "FT", "-", np.nan, "PT"])

V1 = [2, 3, 5, np.nan, 7, 1, np.nan, 10, 14, "-", 6]


df0 = pd.DataFrame({
                   
                   
                   "status": status,
                   
                   "var1" : V1
                   
                  })
df = df0.copy() # original veriyi korumuş olduk
df

   status var1
0      10    2
1      FT    3
2      PT    5
3       -  NaN
4      FT    7
5      PT    1
6      PT  NaN
7      FT   10
8       -   14
9     nan    -
10     PT    6

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   status  10 non-null     object
 1   var1    11 non-null     object
dtypes: object(2)
memory usage: 304.0+ bytes

In [28]:
pd.DataFrame([np.nan, "-", 1])

     0
0  NaN
1    -
2    1